Tekla Open API Reference for Tekla Structures 2025
DrawingObject Properties
The DrawingObject type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the attributes of the current object. Only attributes of the same type as the object are allowed.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
DrawingObject Class
Tekla.Structures.Drawing Namespace